---
type: IConnector
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# IConnector

`Autodesk.Revit.DB.IConnector` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | CoordinateSystem | — | `Transform CoordinateSystem { get ; }` |
| Property | Domain | — | `Domain Domain { get ; }` |
| Property | Height | — | `double Height { get ; }` |
| Property | Origin | — | `XYZ Origin { get ; }` |
| Property | Radius | — | `double Radius { get ; }` |
| Property | Shape | — | `ConnectorProfileType Shape { get ; }` |
| Property | Width | — | `double Width { get ; }` |